uhnp/src/Enums/ВидыСравненияПоказателейОтчетов/ВидыСравненияПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСравненияПоказателейОтчетов</name>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>НеРавно</name>
  </enumValues>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>ВИерархии</name>
  </enumValues>
  <enumValues>
    <name>НеВИерархии</name>
  </enumValues>
  <enumValues>
    <name>ВСписке</name>
  </enumValues>
  <enumValues>
    <name>НеВСписке</name>
  </enumValues>
  <enumValues>
    <name>ВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>Содержит</name>
  </enumValues>
  <enumValues>
    <name>НеСодержит</name>
  </enumValues>
  <enumValues>
    <name>Подобно</name>
  </enumValues>
  <enumValues>
    <name>НеПодобно</name>
  </enumValues>
  <enumValues>
    <name>НачинаетсяС</name>
  </enumValues>
  <enumValues>
    <name>НеНачинаетсяС</name>
  </enumValues>
  <enumValues>
    <name>Заполнено</name>
  </enumValues>
  <enumValues>
    <name>НеЗаполнено</name>
  </enumValues>
  <enumValues>
    <name>ПериодНачалаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериодНачалаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ПериодОкончанияОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериодОкончанияСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>СценарийОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчета</name>
  </enumValues>
  <enumValues>
    <name>ВалютаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОтборНеПроизводится</name>
  </enumValues>
  <enumValues>
    <name>АналитикаВидаОтчета</name>
  </enumValues>
  <enumValues>
    <name>тн_СДатойАктуальности</name>
    <comment>// Юдина Екатерина 06.10.2025 Выполнение задач №000055377</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РежимыОтборовАналитическихТаблиц/РежимыОтборовАналитическихТаблиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыОтборовАналитическихТаблиц</name>
  <enumValues>
    <name>Данные</name>
  </enumValues>
  <enumValues>
    <name>Макет</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыЗначенийПоказателейОтчетов/ТипыЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядкиОкругленияОтчетности/ПорядкиОкругленияОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядкиОкругленияОтчетности</name>
  <comment>Порядки округления отчетности</comment>
  <enumValues>
    <name>Окр1</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Окр1000</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Окр1000000</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/АналитическийБланкУХВызовСервера/Module.bsl
#Область ОбщиеФункцииОбработкиРасшифровкиЯчеек

Функция ПолучитьПоказателиТекущейСтроки(СписокОбластейПоказателей,тОбъектАБ,ВидОтчета,СтруктураРасшифровки) Экспорт
	
	
	ТзСвойстваПоказателей = ПолучитьИзВременногоХранилища(тОбъектАБ.ТзСвойстваПоказателейАдрес);
	//ПоказателиТекущегоОтчета = ТзСвойстваПоказателей.Выгрузить(Новый Структура("ВидОтчета",ВидОтчета),"По")
		
	ПоказателиСтроки = Новый ТаблицаЗначений;
	ПоказателиСтроки.Колонки.Добавить("ПоказательОтчета");
	ПоказателиСтроки.Колонки.Добавить("УидГруппыОтборов");
	
	Для Каждого СтрПоказатель Из СписокОбластейПоказателей Цикл
			
		НстрПоказатель = ПоказателиСтроки.Добавить();
		НстрПоказатель.ПоказательОтчета = СтрПоказатель.Значение;
		НстрПоказатель.УидГруппыОтборов = СтрПоказатель.Представление;	
	КонецЦикла;	
	
	ПоказателиСтроки.Свернуть("ПоказательОтчета,УидГруппыОтборов");
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого ПоказательУид Из ПоказателиСтроки Цикл
		текущаяГруппа = тОбъектАБ.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов",ПоказательУид.УидГруппыОтборов));
		Для Каждого СтрОтборГруппы Из текущаяГруппа Цикл
			Если СтрОтборГруппы.ПолеКод = "Организация" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;	
			Если СтрОтборГруппы.ПолеКод = "Сценарий" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;
			Если СтрОтборГруппы.ПолеКод = "ПериодС" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;
            Если СтрОтборГруппы.ПолеКод = "ПериодПо" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;
            Если СтрОтборГруппы.ПолеКод = "Проект" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	
	
	Если МассивУдаляемыхСтрок.Количество() Тогда
		МассивУдаляемыхСтрок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивУдаляемыхСтрок);
		Для Каждого СтрУдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
			ПоказателиСтроки.Удалить(СтрУдаляемаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	РесурыПериодыВСтроках = Новый ТаблицаЗначений;
	РесурыПериодыВСтроках.Колонки.Добавить("ИмяВЗапросе");
	РесурыПериодыВСтроках.Колонки.Добавить("ПоказательОтчета");
    РесурыПериодыВСтроках.Колонки.Добавить("ТипЗначенияПоказателя");
    РесурыПериодыВСтроках.Колонки.Добавить("ЗначениеВалюта");
    РесурыПериодыВСтроках.Колонки.Добавить("ПересчитыватьВалютнуюСумму");
	РесурыПериодыВСтроках.Колонки.Добавить("ИмяОсновнойКолонки");
	
	ИндексПоказателя = 1;
	
	Для Каждого ТекПоказатель ИЗ  ПоказателиСтроки Цикл
		
		СвойствоПоказателя = ТзСвойстваПоказателей.НайтиСтроки(Новый Структура("Ссылка,ВидОтчета",ТекПоказатель.ПоказательОтчета,ВидОтчета));

		Если  СвойствоПоказателя.Количество()=1  Тогда
			  НстрРесурс = РесурыПериодыВСтроках.Добавить();
			  НстрРесурс.ИмяВЗапросе = "Значение"+ИндексПоказателя;
			  НстрРесурс.ПоказательОтчета = ТекПоказатель.ПоказательОтчета;
              НстрРесурс.ТипЗначенияПоказателя = СвойствоПоказателя[0].ТипЗначения;
              НстрРесурс.ИмяОсновнойКолонки         = "Значение"+ИндексПоказателя;

			  НстрРесурс = РесурыПериодыВСтроках.Добавить();
			  НстрРесурс.ИмяВЗапросе = "ЗначениеВалюта"+ИндексПоказателя;
			  НстрРесурс.ПоказательОтчета = ТекПоказатель.ПоказательОтчета;
              НстрРесурс.ТипЗначенияПоказателя = СвойствоПоказателя[0].ТипЗначения;
              НстрРесурс.ЗначениеВалюта = Истина;
              НстрРесурс.ПересчитыватьВалютнуюСумму = СвойствоПоказателя[0].Валютный;  
			  НстрРесурс.ИмяОсновнойКолонки         = "Значение"+ИндексПоказателя;
		  
			  ИндексПоказателя = ИндексПоказателя+1;
					
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если СтруктураРасшифровки = Неопределено Тогда
		 СтруктураРасшифровки = Новый Структура;
	КонецЕсли;	
	
	Если РесурыПериодыВСтроках.Количество() >0 Тогда
		СтруктураРасшифровки.Вставить("АдресРесурсыПериодыВСтроках",ПоместитьВоВременноеХранилище(РесурыПериодыВСтроках,Новый УникальныйИдентификатор));
		СтруктураРасшифровки.Вставить("Ссылка",ПоказателиСтроки[0].ПоказательОтчета);
		СтруктураРасшифровки.Вставить("Уид",ПоказателиСтроки[0].УидГруппыОтборов);

	КонецЕсли;
	
 КонецФункции	
 
Функция ПодготовитьПараметрыВызоваФормыРаскрытий(СтруктураРасшифровки,СтруктураРасшифровкиКонтекста,СвойстваТекущегоОбъекта) Экспорт
		
	СтруктураНезаполненныхАналитик   = СтруктураРасшифровкиКонтекста.СтруктураНезаполненныхАналитик;
	СтруктураОтбираемыхАналитик     = СтруктураРасшифровкиКонтекста.СтруктураОтбираемыхАналитик;
	ОбъектАналитическогоБланка      =  СвойстваТекущегоОбъекта.ОбъектАналитическогоБланка;
	ВалютаОтображения               =  СвойстваТекущегоОбъекта.ВалютаОтображения;
	НастройкиОтборов                =  СвойстваТекущегоОбъекта.НастройкиОтборов;
	
	АдресРесурсыПериодыВСтроках  	= ?(СтруктураРасшифровкиКонтекста.Свойство("АдресРесурсыПериодыВСтроках"),СтруктураРасшифровкиКонтекста.АдресРесурсыПериодыВСтроках,Неопределено);
	РежимМоделирования  			= ?(СвойстваТекущегоОбъекта.Свойство("РежимМоделирования"),СвойстваТекущегоОбъекта.РежимМоделирования,Ложь);
	Заблокирован  					= ?(СвойстваТекущегоОбъекта.Свойство("Заблокирован"),СвойстваТекущегоОбъекта.Заблокирован,Истина);

	ИдентификаторДанныхМоделирование  = ?(СвойстваТекущегоОбъекта.Свойство("ИдентификаторДанныхМоделирование"),СвойстваТекущегоОбъекта.ИдентификаторДанныхМоделирование,Новый УникальныйИдентификатор);
    ИдентификаторСеанса             =  СвойстваТекущегоОбъекта.ИдентификаторСеанса;
	логИзмененныхДанныхАдрес        =  СвойстваТекущегоОбъекта.логИзмененныхДанныхАдрес;
	тОбъект                         =  СвойстваТекущегоОбъекта.тОбъект;
	
	СтруктураОтбираемыхАналитик.Вставить("Валюта",ВалютаОтображения);	
	тОбъектАБ               = ОбъектАналитическогоБланка;		
	МассивПериодов = Новый Массив;
			
	Для Каждого СтрНезаполненнаяАналитика Из СтруктураНезаполненныхАналитик Цикл
		Если СтруктураОтбираемыхАналитик.Свойство(СтрНезаполненнаяАналитика.Ключ) Тогда //Мы имеем дело с аналитикой -группой, нужно ее расшифровать
			Если СтрНезаполненнаяАналитика.Ключ = "ПериодОтчета" Тогда
				МассивПериодов = ПолучитьВложенныеПериоды(СтруктураОтбираемыхАналитик.ПериодОтчета,ОбъектАналитическогоБланка.Периодичность);			
				СтруктураОтбираемыхАналитик.Вставить("ПериодОтчета",МассивПериодов);	
			Иначе	
				МассивЗначений = ПолучитьЭлементыПотомки(СтруктураОтбираемыхАналитик[СтрНезаполненнаяАналитика.Ключ]);			
				СтруктураОтбираемыхАналитик.Вставить(СтрНезаполненнаяАналитика.Ключ,МассивЗначений);	
			КонецЕсли;	 
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтруктураНезаполненныхАналитик.Свойство("ПериодОтчета")     //Если не указан,  период, то берем весь текущий диапазон
		И НЕ СтруктураОтбираемыхАналитик.Свойство("ПериодОтчета") Тогда	
		МассивПериодов = ПериодыУХ.ПолучитьПодчиненныеПериоды(СтруктураРасшифровки.ПериодС, СтруктураРасшифровки.ПериодПо, ОбъектАналитическогоБланка.Периодичность);			
		СтруктураОтбираемыхАналитик.Вставить("ПериодОтчета",МассивПериодов);	
	КонецЕсли;	

	
	Если ЗначениеЗаполнено(АдресРесурсыПериодыВСтроках) Тогда
		РесурыПериодыВстроках = ПолучитьИзВременногоХранилища(АдресРесурсыПериодыВСтроках);
		МассивПоказателей = РесурыПериодыВстроках.ВыгрузитьКолонку("ПоказательОтчета");
	Иначе	
		МассивПоказателей = Новый Массив();
		МассивПоказателей.Добавить(СтруктураРасшифровки.ПоказательСсылка);	
		СтруктураОтбираемыхАналитик.Вставить("ПоказательОтчета",МассивПоказателей);
	КонецЕсли;
	
	СтруктураОтбираемыхАналитик.Вставить("ПоказательОтчета",МассивПоказателей);
	СтруктураОтбираемыхАналитик.Вставить("УидГруппыОтборов",СтруктураРасшифровки.УидГруппыОтборов);

	мПоказателиРаскрытия = ПолучитьИзВременногоХранилища(тОбъектАБ.мПоказателиРаскрытияАдрес);
	
	МассивУдаляемыхКолонок = Новый Массив;
	
	тСвойствАналитик = Новый ТаблицаЗначений;
	тСвойствАналитик.Колонки.Добавить("КодАналитики");
	тСвойствАналитик.Колонки.Добавить("типАналитики");
	тСвойствАналитик.Колонки.Добавить("Аналитика");
    тСвойствАналитик.Колонки.Добавить("СвязьПоВладельцу");
    тСвойствАналитик.Колонки.Добавить("ЭтоЭтапПроекта",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
    тСвойствАналитик.Колонки.Добавить("ОбязательноеЗаполнение",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	тСвойствАналитик.Колонки.Добавить("МетаИмяАналитики");
    тСвойствАналитик.Колонки.Добавить("ОтборЗначений");
	тСвойствАналитик.Колонки.Добавить("ПараметрыОтбораЗначений");
	
	тГруппаРаскрытия = СтруктураРасшифровки.ПоказательСсылка.ГруппаРаскрытия;
			
	ДополнительныйОтбор = Обработки.АналитическийБланк.ПолучитьОписаниеТаблицыТекущихОтборов();
	
	//Заполним дополнительный отбор значениями из поля фильтров
	РасшифровкаГруппОтборов = ПолучитьИзВременногоХранилища(тОбъектАБ.АдресРасшифровкиГруппОтборов);
	
	Если НЕ НастройкиОтборов = Неопределено Тогда
		Для Каждого СтрФильтр Из НастройкиОтборов.ПолучитьЭлементы()[0].ПолучитьЭлементы() Цикл		
			Если СтрФильтр.Использовать Тогда
				тРасшифровкаОтбораМакета  = РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов,ПолеКод",СтруктураРасшифровки.УидГруппыОтборов,СтрФильтр.ПолеКод));	
				Если тРасшифровкаОтбораМакета.Количество() = 1 
					И СтрФильтр.РежимОтбора = Перечисления.РежимыОтборовАналитическихТаблиц.Данные 
					И (тРасшифровкаОтбораМакета[0].Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета 
					ИЛИ тРасшифровкаОтбораМакета[0].Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета
					ИЛИ тРасшифровкаОтбораМакета[0].Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета 
					ИЛИ  тРасшифровкаОтбораМакета[0].Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится) 
					Тогда //Отбор по текущему срезу данных
					
					нДополнительныйОтбор 				= ДополнительныйОтбор.Добавить();
					ЗаполнитьЗначенияСвойств(нДополнительныйОтбор,СтрФильтр);
				КонецЕсли;	
			КонецЕсли;			
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого Аналитика Из СтруктураНезаполненныхАналитик Цикл
		
		нСвойство = тСвойствАналитик.Добавить();
		нСвойство.КодАналитики = Аналитика.Ключ;
		
		Если Аналитика.Ключ = "ПериодОтчета" Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Периоды");	
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "Организация" Тогда 
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Организации");
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "Проект"   Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Проекты");
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "Сценарий" Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Сценарии");
			нСвойство.ОбязательноеЗаполнение = Истина;
		ИначеЕсли  Аналитика.Ключ = "АналитикаВалюта" Тогда
			нСвойство.типАналитики = Новый ОписаниеТипов("СправочникСсылка.Валюты");
			нСвойство.ОбязательноеЗаполнение = Истина;
		
		Иначе	
			
			ТекСубконто =  ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоКоду(Аналитика.Ключ);
			
			Если ЗначениеЗаполнено(ТекСубконто) Тогда
				нСвойство.типАналитики = Новый ОписаниеТипов(ТекСубконто.ТипЗначения);
			КонецЕсли;	 
			
			Для Инд = 1 по ПараметрыСеанса.ЧислоДопАналитик Цикл	
				Если  тГруппаРаскрытия["ВидАналитики"+Инд] = ТекСубконто Тогда	
					нСвойство.ОбязательноеЗаполнение = тГруппаРаскрытия["Аналитика"+Инд+"Обязательна"];
					Если Инд = тГруппаРаскрытия.АналитикаЭтапПроекта Тогда
						 нСвойство.ЭтоЭтапПроекта = Истина;
					КонецЕсли;
					Прервать;
				КонецЕсли;		
			КонецЦикла;					
		КонецЕсли;		
		
		Если нСвойство.типАналитики.ПривестиЗначение() = Неопределено Тогда
			нСвойство.МетаИмяАналитики = "СправочникСсылка."+Метаданные.НайтиПоТипу(нСвойство.типАналитики.Типы()[0]).Имя;
		Иначе
			нСвойство.МетаИмяАналитики = нСвойство.типАналитики.ПривестиЗначение().Метаданные().Имя;
		КонецЕсли;

		тРасшифровкаГруппыОтборов = тОбъектАБ.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов,ПолеКод",СтруктураОтбираемыхАналитик.УидГруппыОтборов,Аналитика.Ключ));
		
		Если тРасшифровкаГруппыОтборов.Количество() = 1 И ЗначениеЗаполнено(тРасшифровкаГруппыОтборов[0].ЗначениеОтбораСтрока) И НЕ тРасшифровкаГруппыОтборов[0].Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОтборНеПроизводится Тогда
			
			ТзПараметровЗапроса = Новый ТаблицаЗначений;
			ТзПараметровЗапроса.Колонки.Добавить("ИмяОтбора");
			ТзПараметровЗапроса.Колонки.Добавить("ТипОтбора");
			ТзПараметровЗапроса.Колонки.Добавить("ЗначениеОтбора");
			ТзПараметровЗапроса.Колонки.Добавить("УидГруппыОтбора");
				
			ТекстОтбора = АналитическийБланкУХСервер.СформироватьТекстОтбораПоМакету("ТекущийСправочник","",тРасшифровкаГруппыОтборов[0],ТзПараметровЗапроса,"Ссылка");
			ТекстОтбора = Прав(ТекстОтбора,СтрДлина(ТекстОтбора)-1);
			
			ТекстЗапроса = "ВЫБРАТЬ 
			|	ТекущийСправочник.Ссылка
			|ИЗ
			|	Справочник."+нСвойство.МетаИмяАналитики+" КАК ТекущийСправочник
			|ГДЕ "+ТекстОтбора;
			
			Если ЗначениеЗАполнено(ТекстОтбора) Тогда		
				нСвойство.ОтборЗначений 			= ТекстЗапроса;
				нСвойство.ПараметрыОтбораЗначений 	= ТзПараметровЗапроса;	
			КонецЕсли;	
					
			нДополнительныйОтбор 				= ДополнительныйОтбор.Добавить();
			нДополнительныйОтбор.ПолеКод      	= Аналитика.Ключ;
			нДополнительныйОтбор.ВидСравнения   = тРасшифровкаГруппыОтборов[0].Отбор;
			нДополнительныйОтбор.ЗначениеОтбора = ЗначениеИзСтрокиВнутр(тРасшифровкаГруппыОтборов[0].ЗначениеОтбораСтрока);
	
		КонецЕсли;
		
		
	КонецЦикла;	
	
	//В расшифровке есть группировочное поле, добавим его в отбор
	Если СтруктураРасшифровки.Свойство("ПутьКРеквизиту") Тогда
		Для Каждого СтрПутьКРеквизиту Из СтруктураРасшифровки.ПутьКРеквизиту Цикл
			Если СтруктураРасшифровки.Свойство(СтрПутьКРеквизиту.Ключ) Тогда		
				нДополнительныйОтбор 				= ДополнительныйОтбор.Добавить();
				нДополнительныйОтбор.ПолеКод      	= СтрПутьКРеквизиту.Значение;
				нДополнительныйОтбор.ВидСравнения   = Перечисления.ВидыСравненияПоказателейОтчетов.Равно;
				нДополнительныйОтбор.ЗначениеОтбора = СтруктураРасшифровки[СтрПутьКРеквизиту.Ключ];		
			КонецЕсли;	
		КонецЦикла;			
	КонецЕсли;	
	
	ДополнительныеПараметры = Новый Структура;
	Если РежимМоделирования Тогда
		ДополнительныеПараметры.Вставить("ИдентификаторСеанса",ИдентификаторДанныхМоделирование);
	Иначе	
		ДополнительныеПараметры.Вставить("ИдентификаторСеанса",ИдентификаторСеанса);
	КонецЕсли;

	ДополнительныеПараметры.Вставить("ДополнительныйФильтр",ДополнительныйОтбор);
	
	Если НЕ ЗначениеЗаполнено(АдресРесурсыПериодыВСтроках)
		И НЕ СтруктураРасшифровки.ПоказательСсылка.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
		ДополнительныеПараметры.Вставить("ЭтоНечисловые", Истина);
	КонецЕсли;
	
	Если СтруктураНезаполненныхАналитик.Свойство("Проект") Тогда
		СтруктураНезаполненныхАналитик.Удалить("Проект"); 
	КонецЕсли;
	
	Результат = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(СтруктураОтбираемыхАналитик,СтруктураНезаполненныхАналитик,ДополнительныеПараметры);	
	
	//Если  НЕ СтруктураРасшифровки.ПоказательСсылка.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
	//	Результат.Колонки.Удалить("Значение");
	//	Результат.Колонки.ЗначениеНеЧисловое.Имя = "Значение";
	//КонецЕсли;	
	
	АдресТзРаскрытия = ПоместитьВовременноеХранилище(Результат,Новый УникальныйИдентификатор);
		
	//Заполняем возможные связи по владельцу
	Для Каждого Аналитика Из тСвойствАналитик Цикл				
		
		мВладельцы = Новый Массив;
		
		Если Аналитика.типАналитики.ПривестиЗначение() = Неопределено ИЛИ СтрНайти(Аналитика.типАналитики.ПривестиЗначение().Метаданные().ПолноеИмя(),"Справочник") = 0 Тогда
			Аналитика.СвязьПоВладельцу =  мВладельцы;
			Продолжить;	
		Иначе	
			Владельцы =  Аналитика.типАналитики.ПривестиЗначение().Метаданные().Владельцы;
		КонецЕсли;	

		Владельцы =  Аналитика.типАналитики.ПривестиЗначение().Метаданные().Владельцы;
		
		Для Каждого тВладелец Из Владельцы Цикл	
			СущВладельцы = тСвойствАналитик.НайтиСтроки(Новый Структура("МетаИмяАналитики",тВладелец.Имя));
			Для Каждого сВладелец Из СущВладельцы Цикл	
				мВладельцы.Добавить(сВладелец.КодАналитики);	
			КонецЦикла;		
		КонецЦикла;		
		Аналитика.СвязьПоВладельцу =  мВладельцы;
		
	КонецЦикла;	
    	
	СтруктураКлючевыхРеквизитов = Новый Структура;
	СтруктураКлючевыхРеквизитов.Вставить("Сценарий"		,тОбъект["Сценарий"]);
	СтруктураКлючевыхРеквизитов.Вставить("Организация"	,тОбъект["Организация"]);
    СтруктураКлючевыхРеквизитов.Вставить("Проект"		,Неопределено);
	СтруктураКлючевыхРеквизитов.Вставить("ПериодОтчета"	,тОбъект["ПериодОтчета"]);
	СтруктураКлючевыхРеквизитов.Вставить("ВидОтчета"	,тОбъект["ВидОтчета"]);
    СтруктураКлючевыхРеквизитов.Вставить("ВложенныеПериоды"	,тОбъектАБ.ВложенныеПериоды.Выгрузить());
	СтруктураКлючевыхРеквизитов.Вставить("ЗаблокированныеПоказатели",тОбъектАБ.ЗаблокированныеПоказатели.Выгрузить());
   	СтруктураКлючевыхРеквизитов.Вставить("ЗаблокированныеПериоды",тОбъектАБ.ЗаблокированныеПериоды.Выгрузить());
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураОтбираемыхАналитик",СтруктураОтбираемыхАналитик);
	СтруктураПараметров.Вставить("СтруктураНезаполненныхАналитик",СтруктураНезаполненныхАналитик);
	СтруктураПараметров.Вставить("АдресТзРаскрытия",АдресТзРаскрытия);
	СтруктураПараметров.Вставить("логИзмененныхПоказателейАдрес",логИзмененныхДанныхАдрес);
	СтруктураПараметров.Вставить("мПоказателиРаскрытияАдрес",тОбъектАБ.мПоказателиРаскрытияАдрес);
	СтруктураПараметров.Вставить("КэшАналитикПоказателейАдрес",тОбъектАБ.КэшАналитикПоказателейАдрес);
	СтруктураПараметров.Вставить("Заблокирован",Заблокирован);
	
	СтруктураПараметров.Вставить("ЕдиницаИзмерения",тОбъект.ЕдиницаИзмерения);
	
	Если тОбъект.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда
		СтруктураПараметров.Вставить("ТекущийДелитель", 1);		
	ИначеЕсли тОбъект.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда	
		СтруктураПараметров.Вставить("ТекущийДелитель", 1000);	
	ИначеЕсли тОбъект.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда			
		СтруктураПараметров.Вставить("ТекущийДелитель", 1000000);
	КонецЕсли;	

	СтруктураПараметров.Вставить("УровеньТочности",тОбъект.УровеньТочности);
	СтруктураПараметров.Вставить("УидГруппыОтборов",СтруктураРасшифровки.УидГруппыОтборов);
	
	СтруктураПараметров.Вставить("тГоризонт",МассивПериодов);
	СтруктураПараметров.Вставить("АдресТаблицыСвойствАналитик",ПоместитьВоВременноеХранилище(тСвойствАналитик,ИдентификаторСеанса));
    СтруктураПараметров.Вставить("ПравилоОбработки",Неопределено);
	СтруктураПараметров.Вставить("ВИБ",Неопределено);

	
	СтруктураПараметров.Вставить("АдресСтруктураКлючевыхРеквизитов",ПоместитьВоВременноеХранилище(СтруктураКлючевыхРеквизитов,ИдентификаторСеанса));
	
	Возврат СтруктураПараметров;
	
КонецФункции	
  
Функция ПолучитьВложенныеПериоды(ПериодОтчета,Периодичность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Периоды.Ссылка КАК ПериодОтчета,
	|	Периоды.Периодичность КАК Периодичность
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ПометкаУдаления = ЛОЖЬ
	|	И Периоды.ДатаНачала >= &ДатаНачала
	|	И Периоды.ДатаОкончания <= &ДатаОкончания
	|	И Периоды.Периодичность = &Периодичность
	|	И Периоды.Произвольный = ЛОЖЬ";
	
	
	Запрос.УстановитьПараметр("Периодичность",Периодичность);
	Запрос.УстановитьПараметр("ДатаНачала",ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ПериодОтчета.ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПериодОтчета");
	
КонецФункции

Функция ПолучитьЭлементыПотомки(ЭлементРодитель)
	
	ТекущийТип = ЭлементРодитель.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначениеСправочика.Ссылка КАК Ссылка
	|ИЗ
	|	//ТекущийСправочник// КАК ЗначениеСправочика
	|ГДЕ
	|	ЗначениеСправочика.ПометкаУдаления = ЛОЖЬ
	|	И ЗначениеСправочика.Ссылка  В ИЕРАРХИИ(&ЭлементРодитель)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ТекущийСправочник//","Справочник."+ТекущийТип);
	
	Запрос.УстановитьПараметр("ЭлементРодитель",ЭлементРодитель);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ВернутьЗаблокированныеПериоды(тОбъектАБ) Экспорт 
	
	Возврат тОбъектАБ.ЗаблокированныеПериоды.Выгрузить().ВыгрузитьКолонку("ПериодОтчета");

КонецФункции	


Функция ВернутьЗаблокированныеПоказатели(тОбъектАБ) Экспорт 
	
	Возврат тОбъектАБ.ЗаблокированныеПоказатели.Выгрузить().ВыгрузитьКолонку("ПоказательОтчета");

КонецФункции

#КонецОбласти
